Revit 2027 API
BuiltInFailures.RebarFailures.CrankTypeWasDeleted Property
 Crank type was deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CrankTypeWasDeleted { get; }
Public Shared ReadOnly Property CrankTypeWasDeleted As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CrankTypeWasDeleted {
	FailureDefinitionId^ get ();
}
static member CrankTypeWasDeleted : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace